cases/Tests/prescribed_ALM/harmonic_actuatorLine/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name 	foil;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder;
            p1 (0 0 -0.65);
            p2 (0 0 0.65);
            radius 0.14;
        }
    }

    {
        name    foil;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set foil;
        }
    }
);

// ************************************************************************* //
